12/data/attachments/1d5ed1c7ebf5b266.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b8bdc268-8d1c-4fe1-af39-b8ece679cdb1</nif:username>
            <nif:friendToBeAdded>Ashley_want_Actions_34623_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>